[
  "Here is the list of signs at $line, along with their scores and descriptions:",
  "",
  "1. Aries - 7/10 - Aries' impulsiveness and desire for independence can lead to some missed connections, but their enthusiasm can also bring in new opportunities.",
  "2. Taurus - 8/10 - Taurus' practicality and attention to detail make them reliable, and their calm nature helps them navigate $line's ups and downs.",
  "3. Gemini - 9/10 - Geminis are natural communicators, which serves them well in navigating the complex web of $line connections.",
  "4. Cancer - 6/10 - Cancers' emotional sensitivity can sometimes make it hard for them to adapt to the fast-paced world of $line, but their nurturing nature helps them build strong relationships.",
  "5. Leo - 8/10 - Leos' natural charm and charisma help them attract new connections, and their confidence keeps them moving forward in $line.",
  "6. Virgo - 7/10 - Virgos' analytical minds can sometimes make it difficult for them to trust others on $line, but their attention to detail helps them spot potential problems early.",
  "7. Libra - 9/10 - Libras' natural balance and diplomacy skills help them navigate the complex world of $line connections, and their ability to see both sides keeps them from getting stuck in one place.",
  "8. Scorpio - 6/10 - Scorpios' intensity can sometimes make it hard for them to connect with others on $line, but their passion and determination keep them pushing forward.",
  "9. Sagittarius - 8/10 - Sagittarians' adventurous spirits and love of exploration help them navigate the many twists and turns of $line, and their optimism keeps them looking ahead.",
  "10. Capricorn - 7/10 - Capricorns' practicality and discipline help them build strong connections on $line, but their reserved nature can sometimes make it hard for others to get close.",
  "11. Aquarius - 9/10 - Aquarians' natural humanitarianism and ability to see the big picture helps them connect with others on a deep level, making them successful on $line.",
  "12. Pisces - 8/10 - Pisces' empathetic nature and imagination help them navigate the complex emotions of $line connections, and their adaptability keeps them moving forward."
]
