[
  "Here is the list:",
  "",
  "1. Aries - 6/10 - Impulsive and emotional, Aries can struggle to articulate their thoughts clearly in a concise manner.",
  "2. Taurus - 8/10 - Practical and grounded, Taurus' clear and logical thinking makes them excellent at conveying their ideas effectively.",
  "3. Gemini - 9/10 - Quick-witted and communicative, Geminis are natural storytellers and can easily convey complex information in an engaging way.",
  "4. Cancer - 5/10 - Emotional and empathetic, Cancers may struggle to separate personal feelings from the message they're trying to convey, leading to ambiguity.",
  "5. Leo - 8/10 - Confident and charismatic, Leos' natural flair for drama can make their messages engaging and memorable, but may also lead to exaggeration.",
  "6. Virgo - 7/10 - Analytical and detail-oriented, Virgos are thorough in their communication, but may come across as overly critical or pedantic at times.",
  "7. Libra - 9/10 - Diplomatic and balanced, Libras' natural talent for compromise and fairness makes them excellent mediators and communicators.",
  "8. Scorpio - 6/10 - Passionate and intense, Scorpios can be bluntly honest to a fault, which may lead to misunderstandings or hurt feelings if not tempered with tact.",
  "9. Sagittarius - 7/10 - Optimistic and enthusiastic, Sagittarians are natural motivators and can convey their ideas with infectious energy, but may also come across as too vague or idealistic at times.",
  "10. Capricorn - 6/10 - Disciplined and responsible, Capricorns' serious demeanor can make them appear aloof or unapproachable if they don't balance their communication with warmth and empathy.",
  "11. Aquarius - 8/10 - Humanitarian and innovative, Aquarians are natural visionaries who can convey complex ideas in a clear and compelling manner, but may struggle to connect emotionally with others.",
  "12. Pisces - 4/10 - Dreamy and imaginative, Pisces' fluid thinking can make their messages unclear or confusing if not grounded in reality."
]
