[
  "Here is the list of signs and their scores at $line:",
  "",
  "1. AirSigns - 7/10 - Can be effective for general announcements, but may not grab attention as much as other signs.",
  "2. EarthSigns - 9/10 - Strong and noticeable, these signs can effectively convey important messages.",
  "3. FireSigns - 8/10 - Bold and attention-grabbing, these signs are well-suited for urgent or important announcements.",
  "4. WaterSigns - 6/10 - Can be effective for subtle or calming messages, but may not stand out as much as other signs.",
  "5. AriesSigns - 9/10 - Confident and bold, these signs can effectively convey messages with authority.",
  "6. TaurusSigns - 8/10 - Reliable and practical, these signs are well-suited for conveying important information.",
  "7. GeminiSigns - 7/10 - Versatile and adaptable, these signs can be effective for general announcements or creative messaging.",
  "8. CancerSigns - 9/10 - Emotional and empathetic, these signs are well-suited for conveying sensitive or personal messages.",
  "9. LeoSigns - 9/10 - Confident and attention-grabbing, these signs are well-suited for bold or important announcements.",
  "10. VirgoSigns - 8/10 - Analytical and practical, these signs can effectively convey detailed information.",
  "11. LibraSigns - 7/10 - Diplomatic and social, these signs can be effective for conveying messages that require balance and fairness.",
  "12. ScorpioSigns - 9/10 - Intense and perceptive, these signs are well-suited for conveying important or sensitive information.",
  "13. SagittariusSigns - 8/10 - Adventurous and optimistic, these signs can effectively convey messages with enthusiasm and energy.",
  "14. CapricornSigns - 7/10 - Disciplined and responsible, these signs can be effective for conveying important information in a structured way.",
  "15. AquariusSigns - 9/10 - Innovative and independent, these signs are well-suited for conveying unique or unconventional ideas.",
  "16. PiscesSigns - 8/10 - Empathetic and imaginative, these signs can effectively convey messages with creativity and emotional resonance."
]
