[
  "Here is the list of zodiac signs and their corresponding scores at $line:",
  "",
  "1. Aries - 6/10 - Aries' natural impulsiveness can lead to some mistakes, but their courage often helps them overcome those mistakes.",
  "2. Taurus - 8/10 - Taurus' practicality and patience help them make solid decisions, but their stubbornness can sometimes hold them back.",
  "3. Gemini - 7/10 - Geminis' quick thinking and adaptability help them navigate unexpected situations, but their tendency to scatterbrained-ness can lead to some mistakes.",
  "4. Cancer - 9/10 - Cancers' intuition and emotional intelligence give them a strong sense of direction, but their moodiness can sometimes throw off their decision-making.",
  "5. Leo - 8/10 - Leos' confidence and charisma often help them make bold moves, but their pride can lead to overestimating themselves.",
  "6. Virgo - 7/10 - Virgos' attention to detail and analytical minds help them make sound decisions, but their perfectionism can sometimes paralyze them.",
  "7. Libra - 8/10 - Librans' natural diplomacy and people-pleasing abilities help them navigate complex situations, but their indecisiveness can lead to missed opportunities.",
  "8. Scorpio - 9/10 - Scorpios' intensity and focus help them make bold, calculated moves, but their passion can sometimes cloud their judgment.",
  "9. Sagittarius - 7/10 - Sagittarians' enthusiasm and optimism often drive them forward, but their tendency to overthink things can lead to hesitation.",
  "10. Capricorn - 8/10 - Capricorns' discipline and ambition help them make smart decisions, but their pessimism can sometimes hold them back.",
  "11. Aquarius - 6/10 - Aquarians' humanitarian nature and unconventional thinking often drive innovative ideas, but their tendency to disregard rules can lead to mistakes.",
  "12. Pisces - 5/10 - Pisces' empathetic nature and creative intuition help them navigate complex situations, but their dreaminess can sometimes cloud their judgment.",
  "",
  "Note: The scores are subjective and based on general astrological interpretations."
]
