[
  "Here is the list of signs at $LINE and their scores:",
  "",
  "1. Aries - 7/10 - Aries are natural-born leaders, but their impulsive nature can sometimes put them at odds with others.",
  "2. Taurus - 8/10 - Tauruses value stability and security, making them reliable and consistent partners, but they can be stubborn when it comes to change.",
  "3. Gemini - 9/10 - Geminis are quick-witted and adaptable, making them excellent communicators and problem-solvers, but their short attention span can be frustrating for others.",
  "4. Cancer - 6/10 - Cancers are empathetic and nurturing, but their emotional sensitivity can make it difficult for them to set boundaries or prioritize their own needs.",
  "5. Leo - 8/10 - Leos are charismatic and confident, making them natural performers, but their need for attention can sometimes overshadow the needs of others.",
  "6. Virgo - 9/10 - Virgos are analytical and practical, making them excellent planners and organizers, but their perfectionism can lead to anxiety and self-doubt.",
  "7. Libra - 8/10 - Librans value fairness and harmony, making them natural peacemakers, but their indecisiveness can sometimes hold them back from making tough decisions.",
  "8. Scorpio - 7/10 - Scorpios are passionate and intense, making them excellent investigators and detectives, but their tendency to brood over past hurts can be unhealthy.",
  "9. Sagittarius - 8/10 - Sagittarians are adventurous and optimistic, making them natural explorers and philosophers, but their love of freedom can sometimes lead to recklessness.",
  "10. Capricorn - 7/10 - Capricorns are disciplined and responsible, making them excellent leaders and planners, but their stern exterior can make it difficult for others to get close to them.",
  "11. Aquarius - 8/10 - Aquarians are humanitarian and independent, making them natural rebels and innovators, but their detachment from emotions can sometimes make it hard for them to connect with others.",
  "12. Pisces - 6/10 - Pisces are compassionate and imaginative, making them excellent dreamers and visionaries, but their tendency to avoid conflict and responsibility can lead to feelings of guilt or regret.",
  "",
  "Note: These scores are subjective and based on general traits associated with each sign, not individual personalities or experiences."
]
