[
  "Here is the list of signs with their scores and descriptions:",
  "",
  "1. Taurus - 8/10 - Reliable, practical, and down-to-earth, Tauruses tend to be good at $line due to their financial savvy.",
  "2. Cancer - 6/10 - Cancers can be impulsive spenders, but their emotional connection to money often leads them to make smart decisions.",
  "3. Virgo - 9/10 - Analytical and detail-oriented, Virgos are excellent at managing finances and making sound investments.",
  "4. Scorpio - 7/10 - Passionate and intense, Scorpios can be reckless with money, but their intuition often guides them towards shrewd financial moves.",
  "5. Capricorn - 8/10 - Ambitious and disciplined, Capricorns are natural-born savers who excel at managing finances and building wealth.",
  "6. Aquarius - 4/10 - Humanitarians at heart, Aquarians often prioritize philanthropy over personal finance, leading to occasional financial missteps.",
  "7. Pisces - 3/10 - Dreamy and imaginative, Pisces can be reckless spenders due to their lack of financial discipline and tendency to live in the moment.",
  "8. Aries - 5/10 - Adventurous and impulsive, Aries are prone to making emotional financial decisions that sometimes backfire.",
  "9. Gemini - 4/10 - Versatile and adaptable, Geminis can be scattered with their finances, leading to occasional overspending or missed opportunities.",
  "10. Leo - 7/10 - Confident and charismatic, Leos often make bold financial moves that pay off, but they can also be impulsive and reckless at times.",
  "11. Libra - 6/10 - Diplomatic and social, Librans strive for balance in all aspects of life, including finance, but may occasionally prioritize relationships over personal finances.",
  "12. Sagittarius - 5/10 - Optimistic and freedom-loving, Sagittarians often prioritize experiences over material possessions, leading to occasional financial missteps.",
  "",
  "Note: These scores are based on general astrological insights and should not be taken as professional or personalized financial advice."
]
