[
  "Here is the list of signs at $line, along with their scores and descriptions:",
  "",
  "1. Air - 6/10 - A decent sign overall, but can be improved in terms of overall structure and organization.",
  "2. Earth - 8/10 - Strong foundation and grounding principles make this a reliable and dependable sign.",
  "3. Fire - 9/10 - Passionate and driven, this sign is often a natural-born leader with a strong sense of purpose.",
  "4. Water - 7/10 - Emotions can be intense for this sign, but also highly empathetic and caring towards others.",
  "5. Aries - 8/10 - Confident and adventurous, Aries are known for their bold nature, but can sometimes come across as reckless or impulsive.",
  "6. Taurus - 7/10 - Practical and dependable, Taurus values stability and security above all else, which can sometimes make them appear stubborn or resistant to change.",
  "7. Gemini - 9/10 - Quick-witted and adaptable, Geminis are known for their love of learning and communication, but can also be scatterbrained or indecisive at times.",
  "8. Cancer - 8/10 - Nurturing and caring, Cancers have a strong connection to family and home life, which can sometimes make them appear overly emotional or clingy.",
  "9. Leo - 7/10 - Confident and charismatic, Leos are natural performers who crave attention and admiration, but can also be prideful or domineering at times.",
  "10. Virgo - 8/10 - Analytical and detail-oriented, Virgos are known for their dedication to hard work and service, but can sometimes come across as perfectionistic or critical.",
  "11. Libra - 9/10 - Diplomatic and social, Libras value balance and harmony above all else, which makes them excellent mediators and peacemakers, but also prone to indecision or people-pleasing.",
  "12. Scorpio - 8/10 - Passionate and intense, Scorpios are known for their strong intuition and ability to penetrate to the heart of any matter, but can also be secretive or manipulative at times.",
  "13. Sagittarius - 9/10 - Adventurous and optimistic, Sagittarians love to explore new horizons and seek knowledge, which makes them natural philosophers, but can also be reckless or blunt in their approach.",
  "14. Capricorn - 8/10 - Responsible and ambitious, Capricorns are known for their discipline and perseverance, but can also be overly critical or perfectionistic at times.",
  "15. Aquarius - 9/10 - Humanitarian and innovative, Aquarians are natural rebels who value individuality and freedom above all else, which makes them excellent visionaries, but can also be detached or aloof to others' needs.",
  "16. Pisces - 7/10 - Compassionate and imaginative, Pisces are known for their empathetic nature and connection to the spiritual realm, but can also be dreamy or unclear about their goals at times."
]
