[
  "Here is the list of astrological signs and their corresponding scores based on their compatibility with $line:",
  "",
  "1. Aries - 7/10 - Aries' impulsive nature can sometimes clash with $line's attention to detail, but their shared enthusiasm for new experiences can create a strong connection.",
  "2. Taurus - 8/10 - Taurus' practicality and reliability align well with $line's structured approach, and their shared appreciation for stability can foster a sense of security.",
  "3. Gemini - 6/10 - Gemini's quick wit and adaptability can sometimes outpace $line's more methodical pace, but their shared love of learning and exploring new ideas can lead to engaging conversations.",
  "4. Cancer - 9/10 - Cancer's nurturing nature and emotional depth resonate strongly with $line's empathetic understanding, creating a harmonious and supportive connection.",
  "5. Leo - 7/10 - Leo's confidence and charisma can sometimes overwhelm $line's more reserved nature, but their shared passion for creative expression can lead to inspiring collaborations.",
  "6. Virgo - 8/10 - Virgo's analytical mind and attention to detail align well with $line's structured approach, and their shared commitment to hard work and dedication can create a strong foundation.",
  "7. Libra - 9/10 - Libra's diplomatic nature and sense of balance resonate strongly with $line's fair-mindedness and ability to consider multiple perspectives, creating a harmonious and peaceful connection.",
  "8. Scorpio - 6/10 - Scorpio's intense passion and drive can sometimes clash with $line's more reserved approach, but their shared intensity and commitment to uncovering truth can create a powerful bond.",
  "9. Sagittarius - 7/10 - Sagittarius' adventurous spirit and love of exploration align well with $line's enthusiasm for learning and exploring new ideas, but their shared tendency towards impulsiveness can sometimes lead to misunderstandings.",
  "10. Capricorn - 8/10 - Capricorn's discipline and responsibility align well with $line's structured approach, and their shared commitment to hard work and dedication can create a strong foundation.",
  "11. Aquarius - 7/10 - Aquarius' humanitarian nature and sense of independence resonate strongly with $line's desire for freedom and autonomy, but their shared tendency towards detachment can sometimes lead to misunderstandings.",
  "12. Pisces - 9/10 - Pisces' empathetic nature and creativity align well with $line's compassionate understanding and artistic expression, creating a harmonious and imaginative connection.",
  "",
  "Please note that these scores are subjective and based on general astrological trends."
]
