[
  "Here is the list of signs and their scores:",
  "",
  "1. Aries - 7/10 - Aries' impulsiveness and competitive nature can sometimes get in the way, but their determination and passion for life make up for it.",
  "2. Taurus - 8.5/10 - Taurus' stubbornness and practicality can be both strengths and weaknesses, but their reliability and sense of security bring a high score.",
  "3. Gemini - 9/10 - Geminis' quick wit and adaptability allow them to thrive in most situations, with only occasional moments of indecisiveness holding them back.",
  "4. Cancer - 6.5/10 - Cancers' emotional sensitivity and nurturing nature make them excellent caregivers, but their moodiness and clinginess can be a drawback.",
  "5. Leo - 8/10 - Leos' confidence and charisma are hard to match, but their ego and need for attention can sometimes lead to reckless decisions.",
  "6. Virgo - 7.5/10 - Virgos' attention to detail and analytical skills make them valuable problem-solvers, but their perfectionism and worrywarts tendencies can be overwhelming.",
  "7. Libra - 8.5/10 - Libras' diplomacy and social grace are exceptional, but their indecisiveness and tendency to prioritize others' opinions over their own can be a weakness.",
  "8. Scorpio - 9.5/10 - Scorpios' intensity and passion for life make them formidable individuals, with only occasional moments of mistrust and possessiveness holding them back.",
  "9. Sagittarius - 8/10 - Sagittarians' optimism and love for exploration are contagious, but their blunt honesty can be hurtful to others at times.",
  "10. Capricorn - 7.5/10 - Capricorns' discipline and ambition drive them to succeed, but their stubbornness and lack of flexibility can make it difficult for them to adapt.",
  "11. Aquarius - 9/10 - Aquarians' humanitarianism and unconventional thinking are refreshing, but their detachment from emotions and tendency to prioritize intellectual pursuits over personal relationships can be a drawback.",
  "12. Pisces - 6/10 - Pisces' empathetic nature and artistic talents make them wonderful companions, but their dreaminess and susceptibility to emotional manipulation can be a liability."
]
