[
  "Here is the list of signs at $line, along with their scores and descriptions:",
  "",
  "1. Aries - 7/10 - Natural-born leaders often struggle with impulsiveness, but $line can help them channel their energy more constructively.",
  "2. Taurus - 8/10 - Earthy, practical signs tend to do well with financial planning and budgeting, making $line a natural fit for their style.",
  "3. Gemini - 6/10 - Quick-witted and adaptable, Geminis often struggle with staying focused on long-term goals; $line can help them prioritize more effectively.",
  "4. Cancer - 5/10 - Emotional signs like Cancer may benefit from $line's emphasis on financial security, but they may also need to balance their desire for stability with their natural empathy and nurturing instincts.",
  "5. Leo - 8/10 - Confident and charismatic, Leos often shine when it comes to entrepreneurial ventures; $line can help them take calculated risks and build a strong financial foundation.",
  "6. Virgo - 9/10 - Analytical and detail-oriented, Virgos tend to excel at budgeting and planning; $line's emphasis on financial discipline aligns well with their natural inclination.",
  "7. Libra - 7/10 - Diplomatic and social signs like Libra often prioritize relationships over finances; $line can help them find a balance between the two.",
  "8. Scorpio - 9/10 - Passionate and intense, Scorpions tend to do well with financial planning and goal-setting; $line's intensity matches their natural energy.",
  "9. Sagittarius - 6/10 - Free-spirited and adventurous, Sagittarians may struggle with the more structured approach of $line, but can benefit from its emphasis on long-term thinking.",
  "10. Capricorn - 8/10 - Serious and ambitious, Capricorns often excel at financial planning and goal-setting; $line's emphasis on discipline and hard work aligns well with their natural inclinations.",
  "11. Aquarius - 7/10 - Humanitarian and independent, Aquarians may benefit from $line's emphasis on building a secure financial foundation, but also need to balance this with their natural desire for freedom and innovation.",
  "12. Pisces - 5/10 - Emotional and dreamy, Pisces often struggle with the more practical aspects of finances; $line can help them find a balance between their creative pursuits and financial security."
]
