[
  "Here is the list:",
  "",
  "1. Aries - 8/10 - Aries are naturally assertive, but at $line they can be a bit too pushy, hence the slightly lower score.",
  "2. Taurus - 9/10 - Tauruses are known for their practicality and grounded nature, making them reliable and dependable in financial matters.",
  "3. Gemini - 7/10 - Geminis are clever and adaptable, but they can be a bit scattered when it comes to money, leading to some impulsive decisions.",
  "4. Cancer - 8.5/10 - Cancers have strong emotional connections with money, making them cautious and responsible spenders, but also prone to occasional overspending.",
  "5. Leo - 9.5/10 - Leos are natural-born leaders, and their confidence can translate well to financial matters, making them successful investors or entrepreneurs.",
  "6. Virgo - 8.5/10 - Virgos are analytical and detail-oriented, which serves them well in managing their finances, but they can also be overly critical of themselves.",
  "7. Libra - 9/10 - Librans value fairness and balance in all aspects of life, including finance, making them excellent at finding compromises and negotiating deals.",
  "8. Scorpio - 8.5/10 - Scorpios are intense and passionate about their goals, which can drive them to succeed financially, but also lead to occasional reckless decisions.",
  "9. Sagittarius - 7.5/10 - Sagittarians are naturally optimistic and enthusiastic, but they can be impulsive when it comes to money, leading to some costly mistakes.",
  "10. Capricorn - 9.5/10 - Capricorns are disciplined and responsible, making them excellent at managing their finances, planning for the future, and achieving long-term success.",
  "11. Aquarius - 8/10 - Aquarians are innovative and humanitarian, but they can be a bit unconventional in their financial approaches, which may not always yield optimal results.",
  "12. Pisces - 7/10 - Pisces are dreamy and idealistic, which can lead to financial mistakes due to unrealistic expectations or poor planning, but they also have a natural ability to connect with others and find opportunities."
]
