[
  "Here is the list of zodiac signs and their scores based on their compatibility with $line:",
  "",
  "1. Aries - 8/10 - Natural-born leaders, Aries are confident and adventurous, which can be a great match for $line's energetic vibe.",
  "2. Taurus - 4/10 - Tauruses value stability and security, which may not align with the spontaneous nature of $line; they might need more reassurance.",
  "3. Gemini - 9/10 - Geminis are adaptable and curious, making them a great match for $line's fast-paced and unpredictable environment.",
  "4. Cancer - 5/10 - Cancers are emotional and nurturing, which may not fit well with $line's emphasis on fun and spontaneity; they might feel overwhelmed.",
  "5. Leo - 7/10 - Leos are confident and passionate, but their need for attention and validation might clash with $line's low-key nature.",
  "6. Virgo - 3/10 - Virgos are analytical and practical, which may not mesh well with the carefree atmosphere of $line; they might feel out of place.",
  "7. Libra - 8/10 - Librans are social and diplomatic, making them a good match for $line's fun-loving vibe and need for harmony.",
  "8. Scorpio - 6/10 - Scorpios are intense and private, which can be an interesting contrast to the light-hearted nature of $line; they might enjoy the excitement but struggle with openness.",
  "9. Sagittarius - 9/10 - Sagittarians are adventurous and optimistic, aligning well with $line's spontaneous energy and love for exploration.",
  "10. Capricorn - 2/10 - Capricorns value structure and tradition, which can be a poor fit with $line's unstructured nature; they might feel frustrated or restricted.",
  "11. Aquarius - 8/10 - Aquarians are humanitarian and independent, making them a great match for $line's unique vibe and desire for freedom.",
  "12. Pisces - 6/10 - Pisces are empathetic and imaginative, which can be an interesting combination with the playful energy of $line; they might enjoy the excitement but struggle with emotional overload.",
  "",
  "Please note that these scores are subjective and based on general zodiac sign traits. Compatibility ultimately depends on individual personalities and experiences."
]
