[
  "Here is the list:",
  "",
  "1. Aries - 7/10 - Aries are naturally drawn to taking risks and making bold moves, but their tendency to act impulsively can sometimes hinder their financial progress.",
  "2. Taurus - 8/10 - Tauruses have a natural talent for managing money and valuing what they have, making them reliable with finances.",
  "3. Gemini - 6/10 - Geminis are easily distracted and may not prioritize saving or investing, but their quick thinking can help them make smart financial decisions on the fly.",
  "4. Cancer - 5/10 - Cancers often prioritize emotions over finances, which can lead to impulsive spending or neglecting budgeting altogether.",
  "5. Leo - 9/10 - Leos have a natural flair for entrepreneurship and making bold moves in business, but their tendency to overspend on luxuries can hinder their financial success.",
  "6. Virgo - 8/10 - Virgos are meticulous and detail-oriented, which serves them well when it comes to budgeting and managing finances.",
  "7. Libra - 7/10 - Librans have a natural sense of fairness and justice, which helps them make wise financial decisions that benefit all parties involved.",
  "8. Scorpio - 9/10 - Scorpios are naturally perceptive and able to sniff out opportunities for financial gain, but their tendency to be secretive about money can sometimes hinder their progress.",
  "9. Sagittarius - 6/10 - Sagittarians often prioritize freedom and spontaneity over finances, which can lead to impulsive spending or neglecting long-term planning.",
  "10. Capricorn - 8/10 - Capricorns are naturally frugal and responsible with money, making them reliable savers and investors.",
  "11. Aquarius - 7/10 - Aquarians have a natural desire for independence and may prioritize their own financial goals over others', which can sometimes lead to impulsive decisions.",
  "12. Pisces - 5/10 - Pisces often struggle with material possessions and may neglect budgeting altogether, but their creativity and intuition can help them make smart financial decisions in the right circumstances."
]
