[
  "Here is the list you requested:",
  "",
  "1. Aries - 6/10 - Natural entrepreneurs, Aries often excel at starting new ventures and generating ideas, but may struggle to maintain consistency.",
  "2. Taurus - 7/10 - With their practical and detail-oriented nature, Tauruses are well-suited for tasks that require patience and dedication, but may not always be open to new ideas.",
  "3. Gemini - 9/10 - Geminis' quick wit and adaptability make them excellent problem-solvers and communicators, but they can also get distracted or restless if not engaged.",
  "4. Cancer - 8/10 - Cancers' empathetic nature and strong intuition serve them well in helping others or providing emotional support, though their own emotions may be more difficult to navigate.",
  "5. Leo - 8/10 - Leos' charisma and confidence make them natural performers and leaders, but they can also struggle with humility or recognizing when it's time to step back.",
  "6. Virgo - 7/10 - Virgos' analytical minds and attention to detail are assets in many areas of life, though their perfectionism can sometimes hold them back from taking risks.",
  "7. Libra - 8/10 - Librans' natural diplomacy and fairness make them excellent mediators or conflict resolvers, but they may need to work on setting boundaries or prioritizing themselves.",
  "8. Scorpio - 9/10 - Scorpions' intensity and determination are powerful forces in driving personal growth and overcoming obstacles, though their passion can sometimes be all-consuming.",
  "9. Sagittarius - 8/10 - Sagittarians' optimism and love of adventure make them natural explorers and philosophers, but they may struggle with commitment or following through on long-term plans.",
  "10. Capricorn - 7/10 - Capricorns' discipline and responsibility are essential for achieving their goals, though their caution can sometimes hold them back from taking necessary risks.",
  "11. Aquarius - 8/10 - Aquarians' humanitarianism and innovation make them natural rebels or game-changers, but they may struggle with emotional intimacy or prioritizing personal relationships.",
  "12. Pisces - 7/10 - Pisces' empathy and compassion are valuable assets in many areas of life, though their own boundaries and decision-making processes can sometimes be cloudy."
]
