[
  ". Aries - 8/10",
  "",
  " They tend to be naturally aggressive and competitive, which makes them well-suited for careers in sports, business, or other high-pressure fields.",
  ". Taurus - 7/10",
  "",
  " Their practicality and attention to detail make them strong candidates for jobs that require precision and a steady hand.",
  ". Gemini - 9/10",
  "",
  " Their natural ability to adapt and think on their feet makes them well-suited for careers in the tech or media industries where they can constantly learn and grow.",
  ". Cancer - 6/10",
  "",
  " They tend to be emotionally driven, which can sometimes make it difficult for them to separate work from personal life.",
  ". Leo - 8/10",
  "",
  " Their charisma and confidence make them natural-born leaders in many fields, especially the arts or entertainment.",
  ". Virgo - 7/10",
  "",
  " Their analytical nature and attention to detail make them strong candidates for jobs that require precision and a steady hand.",
  ". Libra - 9/10",
  "",
  " Their natural ability to balance multiple perspectives makes them well-suited for careers in law, politics, or other fields where they can help others find harmony.",
  ". Scorpio - 5/10",
  "",
  " They tend to be naturally intense and passionate, which can sometimes make it difficult for them to work with others who don't share their same level of intensity.",
  ". Sagittarius - 7/10",
  "",
  " Their optimism and enthusiasm make them well-suited for careers that allow them to explore new horizons and challenge themselves.",
  "0. Capricorn - 8/10",
  "",
  " Their discipline and ambition make them strong candidates for jobs that require dedication and perseverance.",
  "1. Aquarius - 9/10",
  "",
  " Their natural ability to see the bigger picture makes them well-suited for careers in science, technology, or other fields where they can help make a positive impact on society.",
  "2. Pisces - 6/10",
  "",
  " They tend to be naturally empathetic and imaginative, which can sometimes make it difficult for them to separate work from personal life."
]
