[
  "Here is the list:",
  "",
  "1. Aries - 7/10 - Natural-born leaders, Aries tend to excel at $line due to their competitive nature and willingness to take risks.",
  "2. Taurus - 5/10 - Tauruses can be stubborn and resistant to change, which may hinder their progress in $line, but their practicality and attention to detail can also help them succeed.",
  "3. Gemini - 8/10 - Geminis are quick-witted and adaptable, making them naturals at $line. Their ability to think on their feet and communicate effectively is a major asset.",
  "4. Cancer - 4/10 - Cancers' emotional nature can sometimes cloud their judgment in $line, but their intuition and caring instincts can also help them make smart financial decisions.",
  "5. Leo - 9/10 - Leos are natural performers who thrive on attention and applause, making them well-suited to $line. Their confidence and charisma can help them excel in this area.",
  "6. Virgo - 6/10 - Virgos are meticulous and analytical, which serves them well in $line. However, their perfectionism can sometimes lead to indecision and hesitation.",
  "7. Libra - 5/10 - Librans value fairness and balance, which can sometimes make it difficult for them to make tough financial decisions. However, their diplomacy and social skills are valuable assets in negotiations and partnerships.",
  "8. Scorpio - 9/10 - Scorpios are passionate and intense, driving them to excel at $line. Their determination and strategic thinking can help them achieve their financial goals.",
  "9. Sagittarius - 7/10 - Sagittarians are optimistic and freedom-loving, which can sometimes lead to impulsive decisions in $line. However, their enthusiasm and love of adventure can also inspire creative solutions.",
  "10. Capricorn - 8/10 - Capricorns are responsible and disciplined, making them well-suited to long-term financial planning. Their ambition and perseverance can help them achieve their goals.",
  "11. Aquarius - 7/10 - Aquarians are humanitarians who value independence and innovation. While they may not be naturally inclined towards $line, their unconventional thinking and vision can help them create new financial opportunities.",
  "12. Pisces - 3/10 - Pisces' dreamy nature can sometimes lead to unrealistic expectations in $line. However, their empathy and compassion can also inspire creative solutions that benefit all parties involved."
]
