[
  "Here is the list:",
  "",
  "1. Aries - 8/10 - Fearless risk-takers, Aries are naturally drawn to $line and tend to thrive in high-stakes environments.",
  "2. Taurus - 5/10 - Practical and down-to-earth, Tauruses may struggle with the uncertainty of $line, but their determination can help them achieve modest success.",
  "3. Gemini - 9/10 - Quick-witted and adaptable, Geminis excel at $line due to their ability to think on their feet and stay one step ahead.",
  "4. Cancer - 7/10 - Cancers are empathetic and nurturing, which can serve them well in $line, but their emotional attachment may sometimes cloud their judgment.",
  "5. Leo - 8/10 - Confident and charismatic, Leos often shine in $line due to their natural charm and ability to rally support from others.",
  "6. Virgo - 6/10 - Analytical and detail-oriented, Virgos can be cautious but thorough in their approach to $line, which may not always yield the highest rewards.",
  "7. Libra - 9/10 - Diplomatic and social, Librans are skilled at building alliances and navigating complex relationships in $line, which often favors those with strong networks.",
  "8. Scorpio - 8/10 - Passionate and intense, Scorpios are natural-born leaders who can excel in $line due to their ability to motivate themselves and others.",
  "9. Sagittarius - 7/10 - Adventurous and optimistic, Sagittarians may take calculated risks in $line, but their tendency to spread themselves too thin can limit their success.",
  "10. Capricorn - 5/10 - Disciplined and responsible, Capricorns may be overly cautious or rigid in their approach to $line, which can hold them back from achieving their full potential.",
  "11. Aquarius - 9/10 - Humanitarian and independent, Aquarians often bring a unique perspective to $line, leveraging their creativity and innovative thinking to achieve success.",
  "12. Pisces - 4/10 - Intuitive and imaginative, Pisces may struggle with the harsh realities of $line due to their tendency to be overly idealistic or detached from the outcome."
]
