[
  "Here is the list of zodiac signs and their corresponding scores based on various astrological factors:",
  "",
  "1. Aries - 7/10 - Impulsive and action-oriented, Aries are often great at taking risks and starting new projects, but may struggle with following through.",
  "2. Taurus - 8/10 - Practical and dependable, Taurus excels at building stable foundations and creating long-term plans, but can be stubborn and resistant to change.",
  "3. Gemini - 9/10 - Quick-witted and adaptable, Geminis are masters of communication and can think on their feet, but may struggle with emotional depth and stability.",
  "4. Cancer - 6/10 - Emotionally intelligent and empathetic, Cancers have a strong connection to their intuition and care deeply about others, but may be overly sensitive or clingy.",
  "5. Leo - 8.5/10 - Confident and charismatic, Leos have natural leadership abilities and can inspire others with their passion and creativity, but may struggle with pride and arrogance.",
  "6. Virgo - 7.5/10 - Analytical and hardworking, Virgos are meticulous and detail-oriented, but may be overly critical or perfectionistic.",
  "7. Libra - 8/10 - Diplomatic and social, Librans are natural peacemakers who value harmony and balance, but may struggle with indecision and people-pleasing.",
  "8. Scorpio - 9/10 - Intense and passionate, Scorpios have a strong desire to uncover the truth and can be fiercely loyal, but may struggle with trust issues or intense emotional storms.",
  "9. Sagittarius - 7.5/10 - Adventurous and optimistic, Sagittarians are natural explorers who love to learn and expand their horizons, but may struggle with impulsiveness or tactlessness.",
  "10. Capricorn - 8.5/10 - Disciplined and responsible, Capricorns have a strong sense of duty and can be counted on to get things done, but may struggle with rigidity or lack of spontaneity.",
  "11. Aquarius - 9/10 - Humanitarian and independent, Aquarians are natural rebels who value individuality and freedom, but may struggle with detachment or disconnection from others.",
  "12. Pisces - 6.5/10 - Empathetic and imaginative, Pisces have a strong connection to their intuition and can be highly creative, but may struggle with boundaries or emotional overwhelm."
]
