[
  "Here is the list of scores for each zodiac sign:",
  "",
  "1. Aries - 8/10 - Impulsive decisions and action-oriented nature make it challenging to accurately forecast future events.",
  "2. Taurus - 7/10 - Practical and dependable, but also resistant to change, which can affect the accuracy of predictions.",
  "3. Gemini - 9/10 - Quick-witted and adaptable, making them open to new ideas and willing to consider multiple perspectives, leading to more accurate forecasts.",
  "4. Cancer - 6/10 - Emotional intuition can be strong, but also prone to mood swings and attachment to specific outcomes, which can impact prediction accuracy.",
  "5. Leo - 8/10 - Charisma and confidence can lead to accurate assessments of others, but self-centeredness and pride may skew judgments.",
  "6. Virgo - 7/10 - Analytical nature and attention to detail make them skilled at analyzing data, but perfectionism can lead to overthinking and missed cues.",
  "7. Libra - 8/10 - Scales-balancing nature allows for fair-minded analysis of situations, but indecision and people-pleasing tendencies may hinder accurate forecasting.",
  "8. Scorpio - 9/10 - Intense intuition and ability to penetrate to the core of issues make them adept at uncovering hidden truths.",
  "9. Sagittarius - 7/10 - Optimistic nature can lead to overestimation or underestimation, but philosophical approach encourages considering multiple perspectives.",
  "10. Capricorn - 6/10 - Disciplined and responsible, but overly cautious and risk-averse, which can make it difficult to take calculated risks.",
  "11. Aquarius - 8/10 - Humanitarian approach and ability to see the bigger picture make them skilled at predicting societal trends and patterns.",
  "12. Pisces - 9/10 - Empathetic nature and strong intuition allow for deep understanding of others' emotions and motivations, leading to accurate forecasts.",
  "",
  "Keep in mind that these scores are general assessments and may not apply to every individual within each sign."
]
