[
  "Here is the list of signs at $line, along with their scores and descriptions:",
  "",
  "1. Aries - 6/10 - Aries are known for being impulsive and action-oriented, which can sometimes be beneficial but also lead to mistakes.",
  "2. Taurus - 7/10 - Taurus are dependable and practical, making them good at $line, but they may be too cautious and miss opportunities.",
  "3. Gemini - 8/10 - Geminis are quick-witted and adaptable, allowing them to make smart decisions quickly, but their lack of focus can lead to mistakes.",
  "4. Cancer - 5/10 - Cancers are emotional and empathetic, which can help with building connections, but they may be too sensitive to market fluctuations.",
  "5. Leo - 9/10 - Leos are confident and charismatic, making them natural-born leaders at $line, but their ego can sometimes cloud their judgment.",
  "6. Virgo - 8/10 - Virgos are analytical and detail-oriented, making them excellent at researching and analyzing data, but they may be too critical of themselves.",
  "7. Libra - 6/10 - Librans are social and diplomatic, which helps with building relationships and negotiating, but their indecisiveness can lead to missed opportunities.",
  "8. Scorpio - 9/10 - Scorpions are intense and perceptive, allowing them to uncover hidden patterns and make accurate predictions, but their stubbornness can sometimes hold them back.",
  "9. Sagittarius - 7/10 - Sagittarians are optimistic and adventurous, which helps with taking calculated risks, but their impatience can lead to hasty decisions.",
  "10. Capricorn - 8/10 - Capricorns are responsible and disciplined, making them good at planning and executing strategies, but their fear of failure can sometimes hold them back.",
  "11. Aquarius - 7/10 - Aquarians are innovative and humanitarian, which helps with finding creative solutions, but their tendency to question authority can sometimes lead to indecision.",
  "12. Pisces - 5/10 - Pisces are intuitive and empathetic, which helps with reading people and situations, but their lack of boundaries and impulsiveness can sometimes put them at a disadvantage."
]
